erp3l/src/Documents/СтрокаПланаЗакупок/СтрокаПланаЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СтрокаПланаЗакупок</name>
  <basedOn>Document.СтрокаПланаЗакупок</basedOn>
  <registerRecords>InformationRegister.НМЦСтрокиПланаЗакупок</registerRecords>
  <registerRecords>InformationRegister.СтрокиПланаЗакупок</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиВНоменклатуре</registerRecords>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнеПлановойПотребности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВЭлектроннойФорме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполненияДоговора</name>
    <comment>Максимальная дата, когда все стороны договора выполнят свои обязательства</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКурса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПодготовкиЗакупки</name>
    <comment>Дата рассылки уведомлений ответственным о необходимости подготовить лот к публикации</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОфициальногоОбъявленияЗакупки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СтрокаПланаЗакупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиноеМестоПоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытаяЗакупка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакупкаИнновационнойВысокотехнологичнойПродукцииИЛекарственныхСредств</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьАвтоматическоеИзменениеДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтрокиПланаЗакупок</name>
    <type>
      <types>CatalogRef.ИдентификаторыСтрокПлановЗакупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеБолееЧемНа10Процентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеВИныхСлучаях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеТРУиСроков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗакупкиДляИсключенияИзГОЗ</name>
    <type>
      <types>CatalogRef.КатегорииЗакупокДляИсключенияИзГОЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <type>
      <types>CatalogRef.КлассификаторВидовЭкономическойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОКПД2</name>
    <type>
      <types>CatalogRef.КлассификаторПродукцииПоВидамДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоПоставки</name>
    <type>
      <types>CatalogRef.МестаПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьПриРасчетеДолиЗакупокУСМП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВГПЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщиеТребования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизаторЗакупки</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияДляЗаключенияДоговора</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобенностиРынкаЗакупочнойСитуацииВлияющиеНаВеличинуНМЦ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаНМЦЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗакупок</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОценкиИСопоставленияЗаявок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокФормированияЦеныДоговора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметДоговора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПривлечениеМалогоИСреднегоПредпринимательстваКакПодрядчиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикрепленныйФайлОбоснованияНМЦ</name>
    <type>
      <types>CatalogRef.СтрокаПланаЗакупокПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетУчастияМалогоИСреднегоПредпринимательства</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыбораПоставщика</name>
    <type>
      <types>EnumRef.СпособыВыбораПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВВалютеРегламентированногоУчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяОбоснованиеНМЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПроводитсяВСоответствииСФЗ223</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ЕИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКонтракта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКонтрактаВВалютеРегламентированногоУчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеВключенВПланЗакупкиЧасть15Ст4ФЗ223</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРазмещаетсяНаЕИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеИзменений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакупкаОтменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПереходящегоПериода</name>
    <type>
      <types>DocumentRef.СтрокаПланаЗакупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакупкаАннулирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаАннулирования</name>
    <type>
      <types>EnumRef.ПричиныАннулированияПозицииПланаЗакупок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>ДоговорСПокупателем</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>DefinedType.КоэффициентЕдиницыИзмеренияУХ</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоПоставки</name>
      <type>
        <types>CatalogRef.МестаПоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура заказанная поставщику (нет товарных категорий)</comment>
      <type>
        <types>DefinedType.ТипНоменклатураЕХ</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодПотребности</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>CatalogRef.ПриоритетыПотребностей</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Итоговое значение по всем периодам потребности</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяОбоснованиеНМЦ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПервоначальная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоЗаВесьПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПереченьПоставщиковПредоставившихЦеновыеПредложения</name>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.АнкетыПоставщиков</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СпособыОбоснованияНМЦ</name>
    <attributes>
      <name>Способ</name>
      <type>
        <types>EnumRef.СпособыОбоснованияНМЦ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Финансирование</name>
    <attributes>
      <name>ПериодФинансирования</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСМП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Documents/СтрокаПланаЗакупок/Forms/ФормаВыбора/Module.bsl
#Область ОбработкаОсновныхСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Считывание параметров.
	ОтборОрганизаторЗакупки = Параметры.ОрганизаторЗакупки;
	ОтборОрганизацияДляЗаключенияДоговора = Параметры.ОрганизацияДляЗаключенияДоговора;
	ОтборДатаНачала = Параметры.ДатаНачала;
	ОтборДатаОкончания = Параметры.ДатаОкончания;
	ТолькоВПланеЗакупок = Параметры.ТолькоВПланеЗакупок;
	ТолькоУтвержденные = Параметры.ТолькоУтвержденные;
	ПериодЗакупок = Параметры.ПериодЗакупок;
	ОтборВалюта = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры.Отбор, "ВалютаДокумента", Справочники.Валюты.ПустаяСсылка());
	ИсключатьВалюту = Параметры.ИсключатьВалюту;
	// Редактирование текста запроса.
	Если ТолькоВПланеЗакупок Тогда
		ТекстПоиска = "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтрокиПланаЗакупок.СрезПоследних";
		ТекстЗамены = "ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтрокиПланаЗакупок.СрезПоследних";
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, ТекстПоиска, ТекстЗамены);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтбор();
КонецПроцедуры


#КонецОбласти


#Область ОбработкаСобытийЭлементовФормы


&НаКлиенте
Процедура ПериодОтбораПриИзменении(Элемент)
	ОбновитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура РеквизитОтбораПриИзменении(Элемент)
	ОбновитьОтбор();
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыНаКлиенте

&НаКлиенте
Процедура ПериодЗакупок1ПриИзменении(Элемент)
	ОбновитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтбор()
	МассивСтатусовУтвержденных = Новый Массив;
	МассивСтатусовУтвержденных.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыВыгружаемыхОбъектовЕИС.Утвержден"));
	МассивСтатусовУтвержденных.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыВыгружаемыхОбъектовЕИС.Выгружен"));
	МассивСтатусовУтвержденных.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыВыгружаемыхОбъектовЕИС.ОшибкиВыгрузки"));
	МассивСтатусовУтвержденных.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыВыгружаемыхОбъектовЕИС.Размещен"));
	Если ИсключатьВалюту Тогда
		ВидСравненияВалюта = ВидСравненияКомпоновкиДанных.НеРавно;
	Иначе
		ВидСравненияВалюта = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	ОтборыСписковКлиентСерверУХ.ИзменитьЭлементОтбораСписка(
		Список, 
		"ОрганизаторЗакупки", 
		ОтборОрганизаторЗакупки, 
		ЗначениеЗаполнено(ОтборОрганизаторЗакупки));
	ОтборыСписковКлиентСерверУХ.ИзменитьЭлементОтбораСписка(
		Список, 
		"ОрганизацияДляЗаключенияДоговора", 
		ОтборОрганизацияДляЗаключенияДоговора, 
		ЗначениеЗаполнено(ОтборОрганизацияДляЗаключенияДоговора));
	ОтборыСписковКлиентСерверУХ.УстановитьОтборСпискаМежду(
		Список, 
		"ДатаНачалаПодготовкиЗакупки", 
		ПериодОтбора.ДатаНачала,
		ПериодОтбора.ДатаОкончания);
	ОтборыСписковКлиентСерверУХ.ИзменитьЭлементОтбораСписка(
		Список, 
		"ПериодЗакупок", 
		ПериодЗакупок, 
		ЗначениеЗаполнено(ПериодОтбора));
		
	ОтборыСписковКлиентСерверУХ.ИзменитьЭлементОтбораСписка(
		Список, 
		"СостояниеОбъекта", 
		МассивСтатусовУтвержденных, 
		ТолькоУтвержденные,
		ВидСравненияКомпоновкиДанных.ВСписке);
	ОтборыСписковКлиентСерверУХ.ИзменитьЭлементОтбораСписка(
		Список, 
		"ВалютаДокумента", 
		ОтборВалюта, 
		ЗначениеЗаполнено(ОтборВалюта),
		ВидСравненияВалюта);	
	УстановитьВидимостьЭлементов(ЭтаФорма);
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыНаСервере


&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	Форма.Элементы.ОрганизаторЗакупки.Видимость = 
		ЗначениеЗаполнено(Форма.ОтборОрганизаторЗакупки);
	Форма.Элементы.ОрганизацияДляЗаключенияДоговора.Видимость = 
		ЗначениеЗаполнено(Форма.ОтборОрганизацияДляЗаключенияДоговора);
КонецПроцедуры



#КонецОбласти
